In [1]:
import sqlite3
import pandas as pd

In [2]:
cnn = sqlite3.connect("restaurant.db") #sqlite connection

In [3]:
c = cnn.cursor() #sqlite cursor

In [4]:
query = """SELECT * 
        FROM Customers 
        LIMIT 5"""
pd.read_sql_query(query, cnn)

,CustomerID,FirstName,LastName,Email,Address,City,State,Phone,Birthday,FavoriteDish
0,1,Maggi,Domney,mdomney0@wisdompets.com,53177 Fieldstone Pass,San Bernardino,CA,760-702-5469,1938-10-11,15
1,2,Javier,Dawks,jdawks1@red30design.com,25629 Brown Trail,Hartford,CT,860-906-1459,1953-11-21,13
2,3,Aleen,Fasey,afasey2@kinetecoinc.com,41967 Mockingbird Court,Boca Raton,FL,561-410-2222,1900-08-10,3
3,4,Taylor,Jenkins,tjenkins@rouxacademy.org,968 Bartillon Park,Fort Lauderdale,FL,954-555-7424,1961-05-02,8
4,5,Imogen,Kabsch,ikabsch@landonhotel.com,222 Hudson Point,Anderson,SC,864-326-7456,1919-08-27,17

### Challenge 1

Generate a list of customer information. Show their first name, last name, and email address. And sort the list of rasults by last name

In [5]:
query = """
SELECT FirstName, LastName, Email
FROM Customers
ORDER BY LastName
"""
pd.read_sql_query(query, cnn).head(5)

  FirstName  LastName                       Email
0   Giraldo     Algar    galgar21@kinetecoinc.com
1   Gustave  Alphonso  galphonso28@wisdompets.com
2     Romeo    Annett        rannett1e@samoca.org
3     Herby   Aspinal   haspinals@red30design.com
4     Emlyn   Attwool    eattwoolt@hplussport.com

### Challenge 2

Create a table in the database to store customers responses to anniversary invitation. Associate a customer's ID mumber with the number of people they plan to bring in their party

In [6]:
query = """
    DROP TABLE AnniversaryAttendees
    """
c.execute(query)

In [7]:
query = """
CREATE TABLE AnniversaryAttendees(
    CustomerID INTEGER,
    PartySize INTEGER
    )
    """
c.execute(query)

In [8]:
query = """
        SELECT *
        FROM AnniversaryAttendees
    """
pd.read_sql_query(query,cnn)

Empty DataFrame
Columns: [CustomerID, PartySize]
Index: []

### Challenge 3

Create reports that will be used to make three menus.
- Create a report with all the items sorted by price (lowest to hihest)
- Create a report showing appetizers and beverages
- Create a report with all items except beverages

In [9]:
query = """
        SELECT Type, Name, Price, Description 
        FROM Dishes
        ORDER BY Price
        LIMIT 5"""
pd.read_sql_query(query, cnn)

,Type,Name,Price,Description
0,Beverage,Pomegranate Iced Tea,4.0,"Our unique blend of pomegranate juice, black R..."
1,Dessert,Apple Pie,5.0,Made with local granny smith apples to bring y...
2,Dessert,Chocolate Chip Brownie,6.0,A warm chocolate chip brownie served with choc...
3,Beverage,Tropical Blue Smoothie,6.0,This blueberry mint-based smoothie is refreshi...
4,Beverage,Cafe Latte,6.0,Our house blend of espresso and foamed milk. C...

In [10]:
query = """
        SELECT Type, Name, Price, Description 
        FROM Dishes
        WHERE Type == "Beverage" OR Type == "Appetizer"
        ORDER BY Type
        LIMIT 5"""

pd.read_sql_query(query, cnn)

,Type,Name,Price,Description
0,Appetizer,Parmesan Deviled Eggs,8.00,These delectable little bites are made with or...
1,Appetizer,Artichokes with Garlic Aioli,9.00,Our artichokes are brushed with an olive oil a...
2,Appetizer,Panko Stuffed Mushrooms,7.00,Large mushroom caps are filled a savory cream ...
3,Appetizer,Barbecued Tofu Skewers,9.99,"Our barbecued skewers include tofu, cherry tom..."
4,Beverage,Tropical Blue Smoothie,6.00,This blueberry mint-based smoothie is refreshi...

In [11]:
query = """
        SELECT Type, Name, Price, Description 
        FROM Dishes
        WHERE Type != "Beverage" 
        ORDER BY Type
        LIMIT 5"""

pd.read_sql_query(query, cnn)

,Type,Name,Price,Description
0,Appetizer,Parmesan Deviled Eggs,8.00,These delectable little bites are made with or...
1,Appetizer,Artichokes with Garlic Aioli,9.00,Our artichokes are brushed with an olive oil a...
2,Appetizer,Panko Stuffed Mushrooms,7.00,Large mushroom caps are filled a savory cream ...
3,Appetizer,Barbecued Tofu Skewers,9.99,"Our barbecued skewers include tofu, cherry tom..."
4,Dessert,Creme Brulee,9.00,Elegantly crafted creamy vanilla custard with ...

### Challenge 4

Add a customer to the restaurant's loyalty program. Use the following information to create a record:
- Anna Smith (asmith@samoca.org)
- 479 Lapis Dr., Memphis, TN
- Phone: (555) 555-1212; Birthday: July 21, 1973

In [12]:
query = """
        INSERT INTO Customers(FirstName, LastName, Email, Address, City,State, Phone, Birthday)
        VALUES ("Anna", "Smith", "asmith@samoca.org","479 Lapis Dr.", "Memphis","TN","555-555-1212", "1973-07-21")
"""
c.execute(query)

In [13]:
query = """
        SELECT *
        FROM Customers
        ORDER BY CustomerID DESC
        LIMIT 5
"""
pd.read_sql_query(query, cnn)

,CustomerID,FirstName,LastName,Email,Address,City,State,Phone,Birthday,FavoriteDish
0,101,Anna,Smith,asmith@samoca.org,479 Lapis Dr.,Memphis,TN,555-555-1212,1973-07-21,NaN
1,100,Blythe,Leggan,bleggan2r@rouxacademy.org,1622 Golf Course Hill,Montgomery,AL,334-770-7364,1996-06-11,5.0
2,99,Kala,Stevenson,kstevenson@landonhotel.com,95 Waywood Street,Huntington,WV,304-681-5208,1947-11-30,5.0
3,98,Clem,Durdy,cdurdy2p@hplussport.com,594 Bonner Point,Des Moines,IA,515-680-5018,1988-03-10,16.0
4,97,Herb,McParland,hmcparland2o@rouxacademy.org,39 Algoma Park,Chicago,IL,630-950-3309,1916-12-25,14.0

### Challenge 5

Update a customer's contact information

- Taylor Jenkins, of 27170 6th Ave., Washington, DC has moved to 74 Pine St., New York, Ny
Actualizar la informaci√≥n de un cliente en la tabla Customer

In [14]:
query = """
        SELECT *
        FROM Customers
        WHERE FirstName = 'Taylor'
        AND City = 'Washington'
"""
pd.read_sql_query(query, cnn)

,CustomerID,FirstName,LastName,Email,Address,City,State,Phone,Birthday,FavoriteDish
0,26,Taylor,Jenkins,tjenkins@red30design.com,27170 6th Ave.,Washington,DC,202-765-8011,1922-05-05,12

In [15]:
query = """
    UPDATE Customers
    SET Address = '74 Pine St.',
        City = 'New York',
        State = 'NY'
    WHERE CustomerID = 26
"""
c.execute(query)

In [16]:
query = """
        SELECT *
        FROM Customers
        WHERE CustomerID = 26
"""
pd.read_sql_query(query, cnn)

,CustomerID,FirstName,LastName,Email,Address,City,State,Phone,Birthday,FavoriteDish
0,26,Taylor,Jenkins,tjenkins@red30design.com,74 Pine St.,New York,NY,202-765-8011,1922-05-05,12

### Challenge 6

Remove incorrect information from the database: A customer named Norby has notified us he won't be able to keep his Friday reservation (Today i July 24, 2022)

In [17]:
query = """
        SELECT *
        FROM Reservations
        INNER JOIN Customers ON Reservations.CustomerID = Customers.CustomerID
        WHERE Customers.FirstName = "Norby"
        AND Reservations.Date > "2022-07-24"
"""
pd.read_sql_query(query, cnn)

,ReservationID,CustomerID,Date,PartySize,CustomerID,FirstName,LastName,Email,Address,City,State,Phone,Birthday,FavoriteDish
0,2000,64,2022-07-29 18:30:00,4,64,Norby,Sleight,nsleight1r@kinetecoinc.com,16198 Welch Place,Oklahoma City,OK,405-786-8722,1955-11-13,7

In [18]:
query = """
        DELETE FROM Reservations
        WHERE ReservationID = 2000
"""
#c.execute(query, cnn)

or;

In [19]:
"""
UPDATE Reservations
SET Date = NULL
WHERE ReservationId = 2000
"""

'\nUPDATE Reservations\nSET Date = NULL\nWHERE ReservationId = 2000\n'

### Challenge 7

Register a customer for our Anniversary event.
The customer 'atapley2j@kinetecoinc.com' will be in attendance and willl bring 3 friends (PartySize = 4)

In [20]:
query = """
    INSERT INTO AnniversaryAttendees(CustomerID, PartySize)
    VALUES((SELECT CustomerID
           FROM Customers
           WHERE Email = 'atapley2j@kinetecoinc.com'), 4
)"""
c.execute(query)

In [21]:
query = """
        SELECT *
        FROM AnniversaryAttendees
       
"""
pd.read_sql_query(query, cnn)

   CustomerID  PartySize
0          92          4

### Challenge 8

Find the reservation information for a customer whose name aren't quite sure how to spell. Variations of tha name include; Stevensen, Stephensen, Atevenson, Stephenson, Stuyvesant. There are 4 people in the party and today is june 14th.

In [22]:
query = """
        SELECT Customers.FirstName, Customers.LastName, Reservations.Date, Reservations.PartySize
        FROM Customers
        JOIN Reservations ON Customers.CustomerID = Reservations.CustomerID
        WHERE Customers.LastName LIKE "St%"
        AND Reservations.PartySize = 4
        ORDER BY Reservations.Date DESC
"""

pd.read_sql_query(query, cnn)

   FirstName    LastName                 Date  PartySize
0       Paco  Stephenson  2022-06-14 18:30:00          4
1       Paco  Stephenson  2022-03-27 10:00:00          4
2       Kala   Stevenson  2021-10-19 09:30:00          4
3      Orton     Stavers  2021-07-09 17:00:00          4
4       Iver   Stevensen  2020-08-18 16:00:00          4
5       Kala   Stevenson  2020-06-20 12:00:00          4
6      Orton     Stavers  2019-10-24 13:00:00          4
7      Orton     Stavers  2019-07-13 08:00:00          4
8      Orton     Stavers  2019-07-04 11:30:00          4
9       Kala   Stevenson  2019-01-08 13:30:00          4
10      Kala   Stevenson  2018-12-19 15:00:00          4
11     Orton     Stavers  2018-12-03 09:30:00          4

### Challenge 9

Create a reservation for a customer who may or may not already be listed in our Customers table. Use the following information:

- Sam McAdams - 12 August 2022, 6PM (5 people)
- smac@kinetecoinc.com / (555) 555-1212

In [23]:
query = """
    Select CustomerID
    FROM Customers
    WHERE Email = "smac@kinetecoinc.com"
"""
pd.read_sql_query(query, cnn)

Empty DataFrame
Columns: [CustomerID]
Index: []

In [24]:
query = """
INSERT INTO Customers(FirstName, LastName, Email, Phone)
VALUES("Sam","McAdams","smac@kinetecoinc.com","555 555 1212")
"""
c.execute(query)

In [25]:
query = """
    Select CustomerID
    FROM Customers
    WHERE Email = "smac@kinetecoinc.com"
"""
pd.read_sql_query(query, cnn)

   CustomerID
0         102

### Challenge 10

Enter a customer's delivery order into aour database and provide the total cost of the items ordered. Use this information:

- Customer: Loretta Hundey, at 6939 Elka Place
- Items: 1 House Salad, 1 Mini Cheeseburgers and 1 Tropical Blue Smoothie
- Delivery data and time: September 20, 2022 @ 2PM

In [26]:
query = """
        SELECT CustomerID, FirstName, LastName, Phone
        FROM Customers
        WHERE Address = '6939 Elka Place' AND LastName = 'Hundey'
"""
pd.read_sql_query(query, cnn)

   CustomerID FirstName LastName         Phone
0          70   Loretta   Hundey  310-730-8619

In [27]:
query = """
        INSERT INTO Orders(CustomerID, OrderDate)
        VALUES (70, '2022-09-20 14:00:00')
"""
c.execute(query)

In [28]:
query = """
        SELECT *
        FROM Orders
        WHERE CustomerID = 70
        ORDER BY OrderDate DESC
"""
pd.read_sql_query(query, cnn)

   OrderID  CustomerID            OrderDate
0     1001          70  2022-09-20 14:00:00
1      887          70  2022-01-01 08:13:00
2      855          70  2021-11-03 11:33:00
3      836          70  2021-10-11 14:54:00
4      695          70  2021-03-23 15:49:00
5      523          70  2020-06-21 13:19:00
6      465          70  2020-03-14 17:30:00
7      198          70  2019-03-06 13:10:00
8       50          70  2018-08-07 21:57:00

In [29]:
# Adding items to the order created

query = """
    INSERT INTO OrdersDishes(OrderID, DishID)
    VALUES
    (1001, (SELECT DishID FROM Dishes WHERE Name = 'House Salad')),
    (1001, (SELECT DishID FROM Dishes WHERE Name = 'Mini Cheeseburgers')),
    (1001, (SELECT DishID FROM Dishes WHERE Name = 'Tropical Blue Smoothie'))
    
"""
c.execute(query)

In [30]:
query = """
    SELECT *
    FROM Dishes
    JOIN OrdersDishes ON Dishes.DishID  = OrdersDishes.DishID
    WHERE OrdersDishes.OrderID = 1001
"""
pd.read_sql_query(query, cnn)

,DishID,Name,Description,Price,Type,OrdersDishesID,OrderID,DishID
0,7,House Salad,Our house salad is made with romaine lettuce a...,7.0,Main,4022,1001,7
1,4,Mini Cheeseburgers,These mini cheeseburgers are served on a fresh...,8.0,Main,4023,1001,4
2,20,Tropical Blue Smoothie,This blueberry mint-based smoothie is refreshi...,6.0,Beverage,4024,1001,20

### Challenge 11

Update information in the database.
Set Cleo Goldwater's favorite dish to the Quinoa Salmon Salad

In [31]:
# Look what is Quinoa Salmon Salad's id
query = """
    SELECT *
    FROM Dishes
    WHERE Name LIKE 'Qui%'
"""
pd.read_sql_query(query, cnn)

,DishID,Name,Description,Price,Type
0,9,Quinoa Salmon Salad,"Our quinoa salad is served with quinoa, tomato...",9.99,Main

In [32]:
# Find the ID of the costumer
query = """
    SELECT *
    FROM Customers
    WHERE FirstName LIKE 'Cleo%'
"""
pd.read_sql_query(query, cnn)

,CustomerID,FirstName,LastName,Email,Address,City,State,Phone,Birthday,FavoriteDish
0,42,Cleo,Goldwater,cgoldwater15@landonhotel.com,9831 Evergreen Way,Tyler,TX,903-791-7266,1959-09-14,14

In [33]:
query = """
    UPDATE Customers
    SET FavoriteDish = 9
    WHERE CustomerID = 42
"""
c.execute(query)

In [34]:
query = """
    SELECT Customers.FirstName, Customers.LastName, Customers.FavoriteDish, 
           Dishes.DishID, Dishes.Description, Dishes.Name
    FROM Customers
    JOIN Dishes ON Customers.FavoriteDish = Dishes.DishID
    WHERE Customers.FirstName LIKE 'Cleo%'
"""
pd.read_sql_query(query, cnn)

,FirstName,LastName,FavoriteDish,DishID,Description,Name
0,Cleo,Goldwater,9,9,"Our quinoa salad is served with quinoa, tomato...",Quinoa Salmon Salad

### Challenge 12

Identify a few customers who have ordered delivery from the restaurant the most often, so we can send them a promotional coupon.

In [35]:
query = """
    SELECT COUNT(Orders.CustomerID) AS NumberOrders, Customers.CustomerID, 
           Customers.FirstName, Customers.LastName, Customers.Email
    FROM Orders
    JOIN Customers ON Orders.CustomerID = Customers.CustomerID
    GROUP BY Orders.CustomerID
    ORDER BY NumberOrders DESC
    LIMIT 10
"""
pd.read_sql_query(query, cnn)

,NumberOrders,CustomerID,FirstName,LastName,Email
0,20,100,Blythe,Leggan,bleggan2r@rouxacademy.org
1,17,35,Luciano,Winton,lwintony@hplussport.com
2,16,27,Yves,Dell'Abbate,ydellabbateq@rouxacademy.org
3,15,64,Norby,Sleight,nsleight1r@kinetecoinc.com
4,15,39,Oralla,Dayer,odayer12@samoca.org
5,15,16,Carla,Swinfen,cswinfenf@kinetecoinc.com
6,14,76,Dyanna,Fulger,dfulger23@red30design.com
7,14,67,Whitney,Lamberts,wlamberts1u@red30design.com
8,14,57,Kahaleel,Keaton,kkeaton1k@kinetecoinc.com
9,14,30,Emlyn,Attwool,eattwoolt@hplussport.com

Close connections

In [36]:
c.close()
cnn.close()